## Week_02: Homework02 [Python Libraries: Pandas – DataFrame]
**Course:** WMASDS04-Introduction to Data Science with Python
<br>**Name:** Roksana Parvin
<br>**Student_ID:** 20231177

### 1. A laptop sales showroom wants to create a database for their warehouse. The database is used to store the information about all their products and updated frequently when new products arrive at the showroom.

In [2]:
import pandas as pd

##### a) Create a dictionary in Python for their warehouse.

In [3]:
warehouse={'Processor':['Intel Core i7','AMD Ryzen 3D','Intel Core i7','Intel Core i5','AMD Ryzen 3D'],
           'RAM':['8GB','8GB','16GB','8GB','4GB'],
           'Hard Disk':['512GB','512GB','1TB','512GB','512GB'],
           'Screen Size':['13.3 inches','14 inches','15.6 inches','17.3 inches','13.3 inches'],
           'Price(₹)':[85999,64850,114990,75890,59990]    
          }
warehouse

{'Processor': ['Intel Core i7',
  'AMD Ryzen 3D',
  'Intel Core i7',
  'Intel Core i5',
  'AMD Ryzen 3D'],
 'RAM': ['8GB', '8GB', '16GB', '8GB', '4GB'],
 'Hard Disk': ['512GB', '512GB', '1TB', '512GB', '512GB'],
 'Screen Size': ['13.3 inches',
  '14 inches',
  '15.6 inches',
  '17.3 inches',
  '13.3 inches'],
 'Price(₹)': [85999, 64850, 114990, 75890, 59990]}

##### b)Create a dataframe from the dictionary in part a)

In [4]:
index_num=[1,2,3,4,5]
df_w=pd.DataFrame(warehouse, index=index_num)
df_w

       Processor   RAM Hard Disk  Screen Size  Price(₹)
1  Intel Core i7   8GB     512GB  13.3 inches     85999
2   AMD Ryzen 3D   8GB     512GB    14 inches     64850
3  Intel Core i7  16GB       1TB  15.6 inches    114990
4  Intel Core i5   8GB     512GB  17.3 inches     75890
5   AMD Ryzen 3D   4GB     512GB  13.3 inches     59990

##### c)Extract the column Processor and Hard Disk

In [5]:
extract_columns=df_w[['Processor','Hard Disk']]
print(extract_columns)

       Processor Hard Disk
1  Intel Core i7     512GB
2   AMD Ryzen 3D     512GB
3  Intel Core i7       1TB
4  Intel Core i5     512GB
5   AMD Ryzen 3D     512GB

##### d)Retrieve row number 3, 4, 5 and all the columns from the database.

In [6]:
extract_row=df_w.loc[[3,4,5],:]
extract_row

       Processor   RAM Hard Disk  Screen Size  Price(₹)
3  Intel Core i7  16GB       1TB  15.6 inches    114990
4  Intel Core i5   8GB     512GB  17.3 inches     75890
5   AMD Ryzen 3D   4GB     512GB  13.3 inches     59990

##### e)Extract the row number 2 and 3 and column 4 and 5 from the dataframe.

In [7]:
extract_row_col=df_w.iloc[1:3,3:]
extract_row_col

   Screen Size  Price(₹)
2    14 inches     64850
3  15.6 inches    114990

##### f)Add a new row with the following data

In [8]:
new_row={'Processor':'Intel Core i5',
        'RAM':'4GB',
        'Hard Disk':'256GB',
        'Screen Size':'14 inches',
        'Price(₹)':'50200'}

new_df=pd.DataFrame(new_row, index=[6])
df_new_row=pd.concat([df_w,new_df],axis=0)
df_new_row

       Processor   RAM Hard Disk  Screen Size Price(₹)
1  Intel Core i7   8GB     512GB  13.3 inches    85999
2   AMD Ryzen 3D   8GB     512GB    14 inches    64850
3  Intel Core i7  16GB       1TB  15.6 inches   114990
4  Intel Core i5   8GB     512GB  17.3 inches    75890
5   AMD Ryzen 3D   4GB     512GB  13.3 inches    59990
6  Intel Core i5   4GB     256GB    14 inches    50200

##### g) Add a new column named Graphics Card with the following data

In [9]:
#Since there are 5 elements in the column so I will use the original data frame
df_w
df_w['Graphics Card']=['Radeon vega','Intel graphics card','UHD graphics','Radeon vega','NVIDIA graphics']
df_w

       Processor   RAM Hard Disk  Screen Size  Price(₹)        Graphics Card
1  Intel Core i7   8GB     512GB  13.3 inches     85999          Radeon vega
2   AMD Ryzen 3D   8GB     512GB    14 inches     64850  Intel graphics card
3  Intel Core i7  16GB       1TB  15.6 inches    114990         UHD graphics
4  Intel Core i5   8GB     512GB  17.3 inches     75890          Radeon vega
5   AMD Ryzen 3D   4GB     512GB  13.3 inches     59990      NVIDIA graphics

### 2. A four-star hotel wants to create a database of their customers who book rooms on a daily basis.

##### a) Create a dataframe in python using data.

In [10]:
#creating df from excel file
data=pd.read_excel(r'data.xlsx')
df_db=pd.DataFrame(data)
df_db

  Customer’s Name Room Type Length of Stay Meal Preferences Type of Visits
0            John  Standard         2 days              Veg       Personal
1        Pricilla     Suite         3 days          Non Veg       Business
2           Maria   Premium          1 day          Non Veg       Personal
3         Philips  Standard         4 days              Veg       Business
4           Robin   Premium         2 days              Veg       Business

##### b) Assign row index as C1, C2, C3, C4, and C5.

In [11]:
assign_index = ['C1', 'C2', 'C3', 'C4','C5']

# Assign the assign_index as the row index
df_db.index = assign_index
df_db

   Customer’s Name Room Type Length of Stay Meal Preferences Type of Visits
C1            John  Standard         2 days              Veg       Personal
C2        Pricilla     Suite         3 days          Non Veg       Business
C3           Maria   Premium          1 day          Non Veg       Personal
C4         Philips  Standard         4 days              Veg       Business
C5           Robin   Premium         2 days              Veg       Business

##### c) Select two columns Customer Name and Room Type to send it to reception.

In [12]:
df_db_column=df_db[['Customer’s Name','Room Type']]
df_db_column

   Customer’s Name Room Type
C1            John  Standard
C2        Pricilla     Suite
C3           Maria   Premium
C4         Philips  Standard
C5           Robin   Premium

##### d) Select two rows C3 and C4 and two columns Length of Stay and Type of Visit using .loc.

In [13]:
df_db_r_c=df_db.loc[['C3','C4'],['Length of Stay','Type of Visits']]
df_db_r_c

   Length of Stay Type of Visits
C3          1 day       Personal
C4         4 days       Business

##### e) Using .iloc select the first three rows and the first three columns.

In [14]:
df_db_r_c=df_db.iloc[:3,:3]
df_db_r_c

   Customer’s Name Room Type Length of Stay
C1            John  Standard         2 days
C2        Pricilla     Suite         3 days
C3           Maria   Premium          1 day

##### f) Add a new column Transport Service with the data Yes, No, No, Yes, Yes, Yes using the insert command.

In [15]:
col_name='Transport Service'
col_value=['Yes','No','No','Yes','Yes']
df_db.insert(5,col_name,col_value, allow_duplicates = True)
df_db

,Customer’s Name,Room Type,Length of Stay,Meal Preferences,Type of Visits,Transport Service
C1,John,Standard,2 days,Veg,Personal,Yes
C2,Pricilla,Suite,3 days,Non Veg,Business,No
C3,Maria,Premium,1 day,Non Veg,Personal,No
C4,Philips,Standard,4 days,Veg,Business,Yes
C5,Robin,Premium,2 days,Veg,Business,Yes

##### g) Drop a row C4 from the dataset.

In [16]:
df_db.drop(['C4'], axis = 0, inplace = True)
df_db

,Customer’s Name,Room Type,Length of Stay,Meal Preferences,Type of Visits,Transport Service
C1,John,Standard,2 days,Veg,Personal,Yes
C2,Pricilla,Suite,3 days,Non Veg,Business,No
C3,Maria,Premium,1 day,Non Veg,Personal,No
C5,Robin,Premium,2 days,Veg,Business,Yes

##### h) Sort the dataframe by the Length of Stay.

In [17]:
# Sorting
#df_db.sort_values('Customer’s Name', ascending=False)
df_sorted=df_db.sort_values('Length of Stay', ascending=True)
df_sorted

,Customer’s Name,Room Type,Length of Stay,Meal Preferences,Type of Visits,Transport Service
C3,Maria,Premium,1 day,Non Veg,Personal,No
C1,John,Standard,2 days,Veg,Personal,Yes
C5,Robin,Premium,2 days,Veg,Business,Yes
C2,Pricilla,Suite,3 days,Non Veg,Business,No

##### i) Group the data by the Type of Visit and Room.

In [28]:
group = df_db.groupby(['Type of Visits','Room Type'])
group.size().reset_index(name='No of Visitors')

  Type of Visits Room Type  No of Visitors
0       Business   Premium               1
1       Business     Suite               1
2       Personal   Premium               1
3       Personal  Standard               1